Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПользователиГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АутентификацияСтандартная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГруппыПользователей/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Пользователь.
	Если Параметры.Свойство("Пользователь") Тогда
		
		СтандартнаяОбработка = Ложь; ДанныеВыбора = Новый СписокЗначений;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ГруппыПользователей.ГруппаПользователей КАК Значение,
		                      |	ГруппыПользователей.ГруппаПользователей.ПометкаУдаления КАК ПометкаУдаления,
		                      |	ГруппыПользователей.ГруппаПользователей.Наименование КАК Наименование,
		                      |	ГруппыПользователей.ГруппаПользователей.Код КАК Код,
		                      |	ВЫБОР
		                      |		КОГДА ГруппыПользователей.ГруппаПользователей.Наименование ПОДОБНО &СтрокаПоиска
		                      |			ТОГДА ИСТИНА
		                      |		ИНАЧЕ ЛОЖЬ
		                      |	КОНЕЦ КАК НайденоПоНаименованию
		                      |ИЗ
		                      |	РегистрСведений.ГруппыПользователей КАК ГруппыПользователей
		                      |ГДЕ
		                      |	ГруппыПользователей.Пользователь = &Пользователь
		                      |	И (ГруппыПользователей.ГруппаПользователей.Наименование ПОДОБНО &СтрокаПоиска
		                      |			ИЛИ ГруппыПользователей.ГруппаПользователей.Код ПОДОБНО &СтрокаПоиска)
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ГруппыПользователей.ГруппаПользователей.Наименование");
	    Запрос.УстановитьПараметр("СтрокаПоиска", Параметры.СтрокаПоиска + "%");
	    Запрос.УстановитьПараметр("Пользователь", Параметры.Пользователь);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Значение = Новый Структура("Значение,ПометкаУдаления"); ЗаполнитьЗначенияСвойств(Значение, Выборка);
			Если Выборка.НайденоПоНаименованию Тогда
				Представление = СокрП(Выборка.Наименование) + " " + "(" + СокрП(Выборка.Код) + ")";
			Иначе
				Представление = СокрП(Выборка.Код) + " " + "(" + СокрП(Выборка.Наименование) + ")";
			КонецЕсли;
			
		    ДанныеВыбора.Добавить(Значение, Представление);
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПолученияДанныхВыбора()


Функция ОсновнаяГруппаПользователей() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                      |	ГруппыПользователей.Ссылка
	                      |ИЗ
	                      |	(ВЫБРАТЬ ПЕРВЫЕ 1
	                      |		ГруппыПользователей.Ссылка КАК Ссылка,
	                      |		ГруппыПользователей.Ранг КАК Ранг
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			Пользователи.ГруппаПользователей КАК Ссылка,
	                      |			КОЛИЧЕСТВО(Пользователи.Пользователь) КАК Ранг
	                      |		ИЗ
	                      |			РегистрСведений.ГруппыПользователей КАК Пользователи
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			Пользователи.ГруппаПользователей) КАК ГруппыПользователей
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ ПЕРВЫЕ 1
	                      |		ГруппыПользователей.Ссылка,
	                      |		-1
	                      |	ИЗ
	                      |		Справочник.ГруппыПользователей КАК ГруппыПользователей
	                      |	
	                      |	УПОРЯДОЧИТЬ ПО
	                      |		Ранг УБЫВ,
	                      |		Ссылка) КАК ГруппыПользователей
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ГруппыПользователей.Ранг УБЫВ,
	                      |	ГруппыПользователей.Ссылка.ПометкаУдаления,
	                      |	ГруппыПользователей.Ссылка.Наименование");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ГруппыПользователей.ПустаяСсылка();

КонецФункции // ОсновнаяГруппаПользователей()
